# Используем легкий официальный образ Python 3.11
FROM python:3.11-slim

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем файл зависимостей и устанавливаем их
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь исходный код в рабочую директорию
COPY . .

# Создаем директорию для хранения CSV-данных
# При запуске контейнера через volume, локальные файлы будут прокидываться сюда
RUN mkdir -p /app/data

# Точка входа в программу. 
# Пользователю нужно будет передавать только параметры скрипта (--files ... --report ...)
ENTRYPOINT ["python", "main.py"]
